const minus = require('./minus');
// 55 - 5 เท่ากับ 50
test('55 - 5 เท่ากับ 50', ()=> {
    expect(minus(55,5)).toBe(50);
  });
  
// 100 - 2 เท่ากับ 102
test('100 - 2 เท่ากับ 102', ()=> {
    expect(minus(100,2)).toBe(98);
});
  
  // 20 - 15 เท่ากับ 35
  test('20 - 15 เท่ากับ 5', ()=> {
    expect(minus(20,15)).toBe(5);
  });
  // 2 - 1 เท่ากับ 60
test('2 - 1 เท่ากับ 1', ()=> {
    expect(minus(2,1)).toBe(1);
  });
  
  // 99 - 9 เท่ากับ 90
test('99 - 9 เท่ากับ 90', ()=> {
    expect(minus(99,9)).toBe(90);
});
  
